Autodesk.Revit.DB.Structure.BendingDetailDisplayMode
Describes the mode in which the Bending Detail will be represented.
Since:
2025
Since:
2025

Autodesk.Revit.DB.Structure.BendingDetailDisplayMode.Schematic
The bending detail is represented in a schematic way based on the rebar shape's geometry.

Autodesk.Revit.DB.Structure.BendingDetailDisplayMode.Realistic
The bending detail is represented based on the rebar's geometry.